seasons_list = ['зима', 'зима', 'весна', 'весна', 'весна', 'лето', 'лето', 'лето', 'осень', 'осень', 'осень', 'зима']
seasons_dict = {1: 'зима', 2: 'зима', 3: 'весна', 4: 'весна', 5: 'весна', 6: 'лето', 7: 'лето', 8: 'лето', 9: 'осень',
                10: 'осень', 11: 'осень', 12: 'зима'}
zn = int(input("Введите номер месяца в виде целого числа: "))
if zn > 0 and zn < 13:
    print("Время года в списке: ", seasons_list[zn - 1])
    print("Время года в словаре: ", seasons_dict[zn])
else:
    print("Введено неверное значение месяца.")
